cf_billing/InformationRegisters/энргРасчетСреднегоОбъемаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРасчетСреднегоОбъемаМКД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОткрытиеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщикаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугамиМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДлительностиПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДлительностиПериодов</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСезонностьПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиРасчетаСреднегоПотребления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиРасчетаСреднегоПотребления</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаПрошлыйГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаПрошлыйГодОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПериодовОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоказаний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоказанийОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьСреднийОбъемНеБолееМесяцев</Name>
					<Comment>Длительность периода начислений по среднему</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный</Name>
					<Comment>Длительность периода начислений по среднему</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоВсемНачислениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоВсемНачислениямОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьСезонностьПотребленный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСпособыРасчетаПоНаправлениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСпособыРасчетаПоНаправлениям</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПоДням</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределенияСоциальнойНормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыОпределенияСоциальнойНормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСезонностьПеречисление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьЗаПолныйМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСоциальногоНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПоЧасам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗнаменательЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРасчетСреднегоОбъемаМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает среднее потребления МКД.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция РезультатаЗапросаСреднегоПотребленияМКД(Организация, ПериодНачисления, Район) Экспорт 
	
	ГраницыПериода  								= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	НачалоПериодаРасчета							= ГраницыПериода.НачалоОП;
	МВТ  											= Новый МенеджерВременныхТаблиц;
	
	Запрос  			= Новый Запрос;
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Запрос.МенеджерВременныхТаблиц  				= МВТ;
	Текст 											= ТекстЗапросаСреднийОбъемМКД();

	Запрос.Текст 		= Текст;
	Запрос.Выполнить();
	  	
	Текст 								= "ВЫБРАТЬ * ИЗ ПериодыПолученияСезонности КАК ПериодыПолученияСезонности";
	Запрос 								= Новый Запрос(Текст);
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	РезультатПериодыПолученияСезонности = Запрос.Выполнить();
	Выборка 							= РезультатПериодыПолученияСезонности.Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстГраницОтчетногоПериода 	= энргНачисления.ТекстГраницОтчетногоПериода(Выборка.ПериодНачисленияНачало,Выборка.ПериодНачисленияКонец,Ложь);
	КонецЕсли;
	
	Текст 								= "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаПериодов  ИЗ (" + ТекстГраницОтчетногоПериода + ") КАК ВложенныйЗапрос";
	Если НЕ ПустаяСтрока(ТекстГраницОтчетногоПериода) Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
		Пакет.УстановитьТекстЗапроса(Текст);

		СоотвествиеПолей 					= Новый Структура("Организация,Район","Организация","Район");
		
		Параметры 							= Новый Структура;
		ПараметрыВТ 						= Новый Массив;
		ПараметрыВТ.Добавить(Новый Структура());
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей", "ТипПараметраРавно", СоотвествиеПолей));
		
		РегистрыСведений.энргДлительностиПериодов.ПериодыСезонностиКоллекцияПериодов(Схема,Параметры,"ТаблицаПериодов", "ПериодыСезонности");		
	Иначе		
		РегистрыСведений.энргДлительностиПериодов.ПериодыСезонностиПустаяТаблица(Схема,Параметры,"ПериодыСезонности");				
	КонецЕсли;
	
	Запрос 								= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.Выполнить(); 
	
	Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) КАК КоличествоРасчитанныхОбъемов,
	|	МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный) КАК ЭтоОбъемПотребленный,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|				И МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный)
	|			ТОГДА СУММА(ВложенныйЗапрос.ОбъемПотребленный)
	|		КОГДА НЕ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|			ТОГДА СУММА(ВложенныйЗапрос.ОбъемПотребленный)
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ОбъемПотребленный,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|				И НЕ МАКСИМУМ(ВложенныйЗапрос.ЭтоОбъемПотребленный)
	|			ТОГДА СУММА(ВложенныйЗапрос.Объем)
	|		КОГДА НЕ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВложенныйЗапрос.ЭтоОбъемПотребленный) = 1
	|			ТОГДА СУММА(ВложенныйЗапрос.Объем)
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК Объем,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоМесяцевПотребленный) КАК КоличествоМесяцевПотребленный,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоМесяцев) КАК КоличествоМесяцев,
	|	МАКСИМУМ(ВложенныйЗапрос.СуммарныйОбъемПотребленный) КАК СуммарныйОбъемПотребленный,
	|	МАКСИМУМ(ВложенныйЗапрос.СуммарныйОбъем) КАК СуммарныйОбъем,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоМесяцевСезонности) КАК КоличествоМесяцевСезонности,
	|	МАКСИМУМ(ВложенныйЗапрос.КоличествоМесяцевСезонностиПотребленный) КАК КоличествоМесяцевСезонностиПотребленный
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|		ВложенныйЗапрос.СуммарныйОбъемПотребленный КАК СуммарныйОбъемПотребленный,
	|		ВложенныйЗапрос.СуммарныйОбъем КАК СуммарныйОбъем,
	|		ВложенныйЗапрос.СуммарныйОбъемПотребленный / ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПУстаяСсылка)
	|				ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|			ИНАЧЕ ВложенныйЗапрос.КоличествоМесяцев
	|		КОНЕЦ КАК ОбъемПотребленный,
	|		ВложенныйЗапрос.СуммарныйОбъем / ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПУстаяСсылка)
	|				ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|			ИНАЧЕ ВложенныйЗапрос.КоличествоМесяцев
	|		КОНЕЦ КАК Объем,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.ЭтоОбъемПотребленный
	|				ТОГДА ВложенныйЗапрос.КоличествоМесяцев
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМесяцевПотребленный,
	|		ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.ЭтоОбъемПотребленный
	|				ТОГДА ВложенныйЗапрос.КоличествоМесяцев
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМесяцев,
	|		ВЫБОР
	|			КОГДА ВложенныйЗапрос.ЭтоОбъемПотребленный
	|				ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМесяцевСезонностиПотребленный,
	|		ВЫБОР
	|			КОГДА НЕ ВложенныйЗапрос.ЭтоОбъемПотребленный
	|				ТОГДА СУММА(ЕСТЬNULL(ПериодыСезонности.КоличествоМесяцевСезонности, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КоличествоМесяцевСезонности
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПериодыРасчетаСреднего.Организация КАК Организация,
	|			ПериодыРасчетаСреднего.Район КАК Район,
	|			ПериодыРасчетаСреднего.МКД КАК МКД,
	|			ПериодыРасчетаСреднего.Услуга КАК Услуга,
	|			ПериодыРасчетаСреднего.ТочкаУчета КАК ТочкаУчета,
	|			ПериодыРасчетаСреднего.Шкала КАК Шкала,
	|			ПериодыРасчетаСреднего.КоличествоМесяцев КАК КоличествоМесяцев,
	|			ПериодыРасчетаСреднего.ТарифнаяЗона КАК ТарифнаяЗона,
	|			ПериодыРасчетаСреднего.НачалоПериода КАК НачалоПериода,
	|			ПериодыРасчетаСреднего.КонецПериода КАК КонецПериода,
	|			ПериодыРасчетаСреднего.Сезонность КАК Сезонность,
	|			ПериодыРасчетаСреднего.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|			ВЫБОР
	|				КОГДА ПериодыРасчетаСреднего.ЭтоОбъемПотребленный
	|					ТОГДА СУММА(РасчетСреднегоОбъема.ОбъемУслуги)
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммарныйОбъемПотребленный,
	|			ВЫБОР
	|				КОГДА НЕ ПериодыРасчетаСреднего.ЭтоОбъемПотребленный
	|					ТОГДА СУММА(РасчетСреднегоОбъема.ОбъемУслуги)
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммарныйОбъем
	|		ИЗ
	|			ПериодыРасчетаСреднего КАК ПериодыРасчетаСреднего
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|				ПО ПериодыРасчетаСреднего.Район = РасчетСреднегоОбъема.Район
	|					И ПериодыРасчетаСреднего.МКД = РасчетСреднегоОбъема.МКД
	|					И ПериодыРасчетаСреднего.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|					И ПериодыРасчетаСреднего.Шкала = РасчетСреднегоОбъема.Шкала
	|					И ПериодыРасчетаСреднего.ТарифнаяЗона = РасчетСреднегоОбъема.ТарифнаяЗона
	|					И (РасчетСреднегоОбъема.ПериодНачисления МЕЖДУ ПериодыРасчетаСреднего.НачалоПериода И ПериодыРасчетаСреднего.КонецПериода)
	|					И (РасчетСреднегоОбъема.Организация = &Организация)
	|					И (РасчетСреднегоОбъема.Район = &Район)
	//|					И (РасчетСреднегоОбъема.МКД = &МКД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПериодыРасчетаСреднего.Организация,
	|			ПериодыРасчетаСреднего.Район,
	|			ПериодыРасчетаСреднего.МКД,
	|			ПериодыРасчетаСреднего.Услуга,
	|			ПериодыРасчетаСреднего.ТочкаУчета,
	|			ПериодыРасчетаСреднего.Шкала,
	|			ПериодыРасчетаСреднего.КоличествоМесяцев,
	|			ПериодыРасчетаСреднего.ТарифнаяЗона,
	|			ПериодыРасчетаСреднего.ЭтоОбъемПотребленный,
	|			ПериодыРасчетаСреднего.НачалоПериода,
	|			ПериодыРасчетаСреднего.КонецПериода,
	|			ПериодыРасчетаСреднего.Сезонность) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПериодыСезонности КАК ПериодыСезонности
	|			ПО ВложенныйЗапрос.Организация = ПериодыСезонности.Организация
	|				И ВложенныйЗапрос.Район = ПериодыСезонности.Район
	|				И ВложенныйЗапрос.Сезонность = ПериодыСезонности.Сезонность
	|				И (ПериодыСезонности.ПериодНачисления МЕЖДУ ВложенныйЗапрос.НачалоПериода И ВложенныйЗапрос.КонецПериода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.МКД,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.ТочкаУчета,
	|		ВложенныйЗапрос.Шкала,
	|		ВложенныйЗапрос.СуммарныйОбъемПотребленный,
	|		ВложенныйЗапрос.СуммарныйОбъем,
	|		ВложенныйЗапрос.КоличествоМесяцев,
	|		ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|		ВложенныйЗапрос.ТарифнаяЗона,
	|		ВложенныйЗапрос.Сезонность) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона";
	
	Запрос 								= Новый Запрос();
	
	Запрос.Текст 						= Текст;
	Запрос.МенеджерВременныхТаблиц 		= МВТ;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);

	Результат 							= Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаСреднийОбъемМКД()
	
	текст  = 
	"ВЫБРАТЬ
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.Организация КАК Организация,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.Услуга КАК Услуга,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПоказаний КАК КоличествоПоказаний,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПериодов КАК КоличествоПериодов,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.ЗаПрошлыйГодОбъемПотребленный КАК ЗаПрошлыйГодОбъемПотребленный,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПериодовОбъемПотребленный КАК КоличествоПериодовОбъемПотребленный,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.КоличествоПоказанийОбъемПотребленный КАК КоличествоПоказанийОбъемПотребленный,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный КАК НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный,
	|	энргНастройкиРасчетаСреднегоПотребленияСрезПоследних.ПоВсемНачислениямОбъемПотребленный КАК ПоВсемНачислениямОбъемПотребленный
	|ПОМЕСТИТЬ НастройкиРасчетаСреднегоПотребления
	|ИЗ
	|	РегистрСведений.энргНастройкиРасчетаСреднегоПотребления.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргНастройкиРасчетаСреднегоПотребленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Организация КАК Организация,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Район КАК Район,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Услуга КАК Услуга,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.ВидПлощади КАК ВидПлощади,
	|	энргСпособыРасчетаПоНаправлениямСрезПоследних.Сезонность КАК Сезонность
	|ПОМЕСТИТЬ СпособыРасчетаПоНаправлениям
	|ИЗ
	|	РегистрСведений.энргСпособыРасчетаПоНаправлениям.СрезПоследних(
	|			&ПериодНачисления,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргСпособыРасчетаПоНаправлениямСрезПоследних
	|ГДЕ
	|	НЕ энргСпособыРасчетаПоНаправлениямСрезПоследних.Сезонность = ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.КоличествоПредоставленных КАК КоличествоПредоставленных,
	|	ВложенныйЗапрос.СрокНеПредоставления КАК СрокНеПредоставления,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	ВложенныйЗапрос.КоличествоПоказаний КАК КоличествоПоказаний,
	|	ВложенныйЗапрос.КоличествоПериодов КАК КоличествоПериодов,
	|	ВложенныйЗапрос.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|	ВложенныйЗапрос.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|	ВложенныйЗапрос.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ЕСТЬNULL(СпособыРасчетаПоНаправлениям.Сезонность, ЗНАЧЕНИЕ(Справочник.энргВидыСезонности.ПустаяСсылка)) КАК Сезонность
	|ПОМЕСТИТЬ ТочкиДляРасчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетСреднегоОбъема.Район КАК Район,
	|		РасчетСреднегоОбъема.МКД КАК МКД,
	|		РасчетСреднегоОбъема.ТочкаУчета КАК ТочкаУчета,
	|		СтабильныеПериоды.Услуга КАК Услуга,
	|		РасчетСреднегоОбъема.Шкала КАК Шкала,
	|		РасчетСреднегоОбъема.ТарифнаяЗона КАК ТарифнаяЗона,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(РасчетСреднегоОбъема.ПериодНачисления, МЕСЯЦ)) КАК КоличествоПредоставленных,
	|		РАЗНОСТЬДАТ(МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления), &ПериодНачисления, МЕСЯЦ) КАК СрокНеПредоставления,
	|		МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления) КАК КонецПериода,
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПоказаний) КАК КоличествоПоказаний,
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПериодов) КАК КоличествоПериодов,
	|		МАКСИМУМ(СтабильныеПериоды.ЗаПрошлыйГод) КАК ЗаПрошлыйГод,
	|		МАКСИМУМ(СтабильныеПериоды.НачислятьСреднийОбъемНеБолееМесяцев) КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|		ЛОЖЬ КАК ЭтоОбъемПотребленный,
	|		СтабильныеПериоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|		СтабильныеПериоды.Организация КАК Организация
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтабильныеПериоды.Район КАК Район,
	|			СтабильныеПериоды.МКД КАК МКД,
	|			СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			СтабильныеПериоды.Услуга КАК Услуга,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПоказаний КАК КоличествоПоказаний,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПериодов КАК КоличествоПериодов,
	|			НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|			НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|			НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|			СтабильныеПериоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|			СтабильныеПериоды.Организация КАК Организация
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|				ПО СтабильныеПериоды.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга
	|					И (НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|					И (СтабильныеПериоды.Организация = НастройкиРасчетаСреднегоПотребления.Организация)
	|					И (СтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|					И (СтабильныеПериоды.Район = &Район)
	|					И НастройкиРасчетаСреднегоПотребления.Услуга = СтабильныеПериоды.Услуга
	|					И (СтабильныеПериоды.УслугаПодключена)
	|					И (ВЫБОР
	|						КОГДА НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод
	|							ТОГДА ИСТИНА
	|						КОГДА СтабильныеПериоды.ПриборВведен
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ НЕ НАЧАЛОПЕРИОДА(СтабильныеПериоды.ПериодНачисленияВыводаПрибора, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1)
	|					КОНЕЦ)) КАК СтабильныеПериоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|			ПО СтабильныеПериоды.Район = РасчетСреднегоОбъема.Район
	|				И СтабильныеПериоды.МКД = РасчетСреднегоОбъема.МКД
	|				И СтабильныеПериоды.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|				И (РасчетСреднегоОбъема.ПериодНачисления < ВЫБОР
	|					КОГДА СтабильныеПериоды.ЗаПрошлыйГод
	|						ТОГДА НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД)
	|					ИНАЧЕ &ПериодНачисления
	|				КОНЕЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетСреднегоОбъема.Район,
	|		РасчетСреднегоОбъема.МКД,
	|		РасчетСреднегоОбъема.ТочкаУчета,
	|		СтабильныеПериоды.Услуга,
	|		РасчетСреднегоОбъема.Шкала,
	|		РасчетСреднегоОбъема.ТарифнаяЗона,
	|		СтабильныеПериоды.ДатаСостоянияПрибора,
	|		СтабильныеПериоды.Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетСреднегоОбъема.Район,
	|		РасчетСреднегоОбъема.МКД,
	|		РасчетСреднегоОбъема.ТочкаУчета,
	|		СтабильныеПериоды.Услуга,
	|		РасчетСреднегоОбъема.Шкала,
	|		РасчетСреднегоОбъема.ТарифнаяЗона,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(РасчетСреднегоОбъема.ПериодНачисления, МЕСЯЦ)),
	|		РАЗНОСТЬДАТ(МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления), &ПериодНачисления, МЕСЯЦ),
	|		МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления),
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПоказанийОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.КоличествоПериодовОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.ЗаПрошлыйГодОбъемПотребленный),
	|		МАКСИМУМ(СтабильныеПериоды.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный),
	|		ИСТИНА,
	|		СтабильныеПериоды.ДатаСостоянияПрибора,
	|		СтабильныеПериоды.Организация
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтабильныеПериоды.Район КАК Район,
	|			СтабильныеПериоды.МКД КАК МКД,
	|			СтабильныеПериоды.ТочкаУчета КАК ТочкаУчета,
	|			СтабильныеПериоды.Услуга КАК Услуга,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПоказанийОбъемПотребленный КАК КоличествоПоказанийОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.КоличествоПериодовОбъемПотребленный КАК КоличествоПериодовОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГодОбъемПотребленный КАК ЗаПрошлыйГодОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениямОбъемПотребленный КАК ПоВсемНачислениямОбъемПотребленный,
	|			НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный КАК НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный,
	|			СтабильныеПериоды.ДатаСостоянияПрибора КАК ДатаСостоянияПрибора,
	|			СтабильныеПериоды.Организация КАК Организация
	|		ИЗ
	|			РегистрСведений.энргСтабильныеПериодыМКД КАК СтабильныеПериоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|				ПО СтабильныеПериоды.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга
	|					И (НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|					И (СтабильныеПериоды.Организация = &Организация)
	|					И (СтабильныеПериоды.ПериодНачисления = &ПериодНачисления)
	|					И (СтабильныеПериоды.Район = &Район)
	//|					И (СтабильныеПериоды.МКД = &МКД)
	|					И (СтабильныеПериоды.УслугаПодключена)
	|					И (СтабильныеПериоды.ПриборВведен)) КАК СтабильныеПериоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|			ПО СтабильныеПериоды.Район = РасчетСреднегоОбъема.Район
	|				И СтабильныеПериоды.МКД = РасчетСреднегоОбъема.МКД
	|				И СтабильныеПериоды.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|				И (РасчетСреднегоОбъема.ПериодНачисления < ВЫБОР
	|					КОГДА СтабильныеПериоды.ЗаПрошлыйГодОбъемПотребленный
	|						ТОГДА НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД)
	|					ИНАЧЕ &ПериодНачисления
	|				КОНЕЦ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетСреднегоОбъема.Район,
	|		РасчетСреднегоОбъема.МКД,
	|		РасчетСреднегоОбъема.ТочкаУчета,
	|		СтабильныеПериоды.Услуга,
	|		РасчетСреднегоОбъема.Шкала,
	|		РасчетСреднегоОбъема.ТарифнаяЗона,
	|		СтабильныеПериоды.ДатаСостоянияПрибора,
	|		СтабильныеПериоды.Организация) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыРасчетаПоНаправлениям КАК СпособыРасчетаПоНаправлениям
	|		ПО ВложенныйЗапрос.Организация = СпособыРасчетаПоНаправлениям.Организация
	|			И ВложенныйЗапрос.Район = СпособыРасчетаПоНаправлениям.Район
	|			И ВложенныйЗапрос.Услуга = СпособыРасчетаПоНаправлениям.Услуга
	|			И (СпособыРасчетаПоНаправлениям.НаправлениеИспользованияТУ = ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление))
	|			И (НЕ ВложенныйЗапрос.ЗаПрошлыйГод)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.ЗаПрошлыйГод
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВложенныйЗапрос.КоличествоПредоставленных >= 1
	|					И ВложенныйЗапрос.СрокНеПредоставления <= ВложенныйЗапрос.НачислятьСреднийОбъемНеБолееМесяцев
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|	МАКСИМУМ(ВложенныйЗапрос.НачалоПериода) КАК НачалоПериода,
	|	РАЗНОСТЬДАТ(МАКСИМУМ(ВложенныйЗапрос.НачалоПериода), ВложенныйЗапрос.КонецПериода, МЕСЯЦ) + 1 КАК КоличествоМесяцев,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Сезонность КАК Сезонность
	|ПОМЕСТИТЬ ПериодыРасчетаСреднего
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Район КАК Район,
	|		ВложенныйЗапрос.МКД КАК МКД,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|		ВложенныйЗапрос.Шкала КАК Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|		ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|		ВложенныйЗапрос.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|		МИНИМУМ(ВложенныйЗапрос.НачалоПериода) КАК НачалоПериода,
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.КоличествоПоказаний КАК КоличествоПоказаний,
	|		ВложенныйЗапрос.Сезонность КАК Сезонность
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТочкиДляРасчета.Район КАК Район,
	|			ТочкиДляРасчета.МКД КАК МКД,
	|			ТочкиДляРасчета.Услуга КАК Услуга,
	|			ТочкиДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|			ТочкиДляРасчета.Шкала КАК Шкала,
	|			ТочкиДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|			ТочкиДляРасчета.КонецПериода КАК КонецПериода,
	|			ТочкиДляРасчета.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|			МИНИМУМ(РасчетСреднегоОбъема.ПериодНачисления) КАК НачалоПериода,
	|			ТочкиДляРасчета.Организация КАК Организация,
	|			ТочкиДляРасчета.КоличествоПоказаний КАК КоличествоПоказаний,
	|			ТочкиДляРасчета.Сезонность КАК Сезонность
	|		ИЗ
	|			ТочкиДляРасчета КАК ТочкиДляРасчета
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|				ПО ТочкиДляРасчета.Район = РасчетСреднегоОбъема.Район
	|					И ТочкиДляРасчета.МКД = РасчетСреднегоОбъема.МКД
	|					И ТочкиДляРасчета.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|					И ТочкиДляРасчета.Шкала = РасчетСреднегоОбъема.Шкала
	|					И ТочкиДляРасчета.ТарифнаяЗона = РасчетСреднегоОбъема.ТарифнаяЗона
	|					И (РасчетСреднегоОбъема.ПериодНачисления < НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД))
	|					И (РасчетСреднегоОбъема.ПериодНачисления >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, ГОД), ГОД, -1))
	|					И (РасчетСреднегоОбъема.Организация = &Организация)
	|					И (РасчетСреднегоОбъема.Район = &Район)
	//|					И (РасчетСреднегоОбъема.МКД = &МКД)
	|					И (ТочкиДляРасчета.ЗаПрошлыйГод)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТочкиДляРасчета.Район,
	|			ТочкиДляРасчета.МКД,
	|			ТочкиДляРасчета.Услуга,
	|			ТочкиДляРасчета.ТочкаУчета,
	|			ТочкиДляРасчета.Шкала,
	|			ТочкиДляРасчета.ТарифнаяЗона,
	|			ТочкиДляРасчета.КонецПериода,
	|			ТочкиДляРасчета.ЭтоОбъемПотребленный,
	|			ТочкиДляРасчета.Организация,
	|			ТочкиДляРасчета.КоличествоПоказаний,
	|			ТочкиДляРасчета.Сезонность
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВложенныйЗапрос.Район,
	|			ВложенныйЗапрос.МКД,
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.ТочкаУчета,
	|			ВложенныйЗапрос.Шкала,
	|			ВложенныйЗапрос.ТарифнаяЗона,
	|			ВложенныйЗапрос.КонецПериода,
	|			ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|			МАКСИМУМ(ВложенныйЗапрос.НачалоПериода),
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.КоличествоПоказаний,
	|			ВложенныйЗапрос.Сезонность
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ТочкиДляРасчета.Район КАК Район,
	|				ТочкиДляРасчета.МКД КАК МКД,
	|				ТочкиДляРасчета.Услуга КАК Услуга,
	|				ТочкиДляРасчета.ТочкаУчета КАК ТочкаУчета,
	|				ТочкиДляРасчета.Шкала КАК Шкала,
	|				ТочкиДляРасчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|				ТочкиДляРасчета.КонецПериода КАК КонецПериода,
	|				ТочкиДляРасчета.ЭтоОбъемПотребленный КАК ЭтоОбъемПотребленный,
	|				МАКСИМУМ(РасчетСреднегоОбъема.ПериодНачисления) КАК НачалоПериода,
	|				ТочкиДляРасчета.Организация КАК Организация,
	|				ТочкиДляРасчета.КоличествоПоказаний КАК КоличествоПоказаний,
	|				ТочкиДляРасчета.Сезонность КАК Сезонность
	|			ИЗ
	|				ТочкиДляРасчета КАК ТочкиДляРасчета
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргРасчетСреднегоОбъемаМКД КАК РасчетСреднегоОбъема
	|					ПО ТочкиДляРасчета.Район = РасчетСреднегоОбъема.Район
	|						И ТочкиДляРасчета.МКД = РасчетСреднегоОбъема.МКД
	|						И ТочкиДляРасчета.ТочкаУчета = РасчетСреднегоОбъема.ТочкаУчета
	|						И ТочкиДляРасчета.Шкала = РасчетСреднегоОбъема.Шкала
	|						И ТочкиДляРасчета.ТарифнаяЗона = РасчетСреднегоОбъема.ТарифнаяЗона
	|						И (РасчетСреднегоОбъема.ПериодНачисления <= ДОБАВИТЬКДАТЕ(ТочкиДляРасчета.КонецПериода, МЕСЯЦ, -ТочкиДляРасчета.КоличествоПериодов + 1))
	|						И (РасчетСреднегоОбъема.Организация = &Организация)
	|						И (РасчетСреднегоОбъема.Район = &Район)
	//|						И (РасчетСреднегоОбъема.МКД = &МКД)
	|						И (НЕ ТочкиДляРасчета.ЗаПрошлыйГод)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ТочкиДляРасчета.Район,
	|				ТочкиДляРасчета.МКД,
	|				ТочкиДляРасчета.Услуга,
	|				ТочкиДляРасчета.ТочкаУчета,
	|				ТочкиДляРасчета.Шкала,
	|				ТочкиДляРасчета.ТарифнаяЗона,
	|				ТочкиДляРасчета.КонецПериода,
	|				ТочкиДляРасчета.ЭтоОбъемПотребленный,
	|				ТочкиДляРасчета.Организация,
	|				ТочкиДляРасчета.КоличествоПоказаний,
	|				ТочкиДляРасчета.Сезонность) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.КонецПериода,
	|			ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|			ВложенныйЗапрос.Район,
	|			ВложенныйЗапрос.МКД,
	|			ВложенныйЗапрос.Услуга,
	|			ВложенныйЗапрос.ТочкаУчета,
	|			ВложенныйЗапрос.Шкала,
	|			ВложенныйЗапрос.ТарифнаяЗона,
	|			ВложенныйЗапрос.Организация,
	|			ВложенныйЗапрос.КоличествоПоказаний,
	|			ВложенныйЗапрос.Сезонность) КАК ВложенныйЗапрос
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.Район,
	|		ВложенныйЗапрос.МКД,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.ТочкаУчета,
	|		ВложенныйЗапрос.Шкала,
	|		ВложенныйЗапрос.ТарифнаяЗона,
	|		ВложенныйЗапрос.КонецПериода,
	|		ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.КоличествоПоказаний,
	|		ВложенныйЗапрос.Сезонность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТочкиДляРасчета.Район,
	|		ТочкиДляРасчета.МКД,
	|		ТочкиДляРасчета.Услуга,
	|		ТочкиДляРасчета.ТочкаУчета,
	|		ТочкиДляРасчета.Шкала,
	|		ТочкиДляРасчета.ТарифнаяЗона,
	|		ТочкиДляРасчета.КонецПериода,
	|		ТочкиДляРасчета.ЭтоОбъемПотребленный,
	|		ТочкиДляРасчета.ДатаСостоянияПрибора,
	|		ТочкиДляРасчета.Организация,
	|		ТочкиДляРасчета.КоличествоПоказаний,
	|		ТочкиДляРасчета.Сезонность
	|	ИЗ
	|		ТочкиДляРасчета КАК ТочкиДляРасчета) КАК ВложенныйЗапрос
	|ГДЕ
	|	РАЗНОСТЬДАТ(ВложенныйЗапрос.НачалоПериода, ВложенныйЗапрос.КонецПериода, МЕСЯЦ) + 1 >= ВложенныйЗапрос.КоличествоПоказаний
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала,
	|	ВложенныйЗапрос.ТарифнаяЗона,
	|	ВложенныйЗапрос.КонецПериода,
	|	ВложенныйЗапрос.ЭтоОбъемПотребленный,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Сезонность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ПериодыРасчетаСреднего.Район КАК Район,
	|	МИНИМУМ(ПериодыРасчетаСреднего.НачалоПериода) КАК ПериодНачисленияНачало,
	|	МАКСИМУМ(ПериодыРасчетаСреднего.КонецПериода) КАК ПериодНачисленияКонец
	|ПОМЕСТИТЬ ПериодыПолученияСезонности
	|ИЗ
	|	ПериодыРасчетаСреднего КАК ПериодыРасчетаСреднего
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыРасчетаСреднего.Район"; 
	 
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
